src/Documents/УстановкаЦенПредметовСнабжения/УстановкаЦенПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенПредметовСнабжения</name>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <attributes>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>EnumRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/УстановкаЦенПредметовСнабжения/ManagerModule.bsl
//////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьЗначенияРеквизитов(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенПредметовСнабжения.Дата КАК Период,
	|	УстановкаЦенПредметовСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	УстановкаЦенПредметовСнабжения.ТипЦены КАК ТипЦены,
	|	УстановкаЦенПредметовСнабжения.Контрагент КАК Контрагент,
	|	УстановкаЦенПредметовСнабжения.Цена КАК Цена,
	|	УстановкаЦенПредметовСнабжения.Количество КАК Количество,
	|	УстановкаЦенПредметовСнабжения.Валюта КАК Валюта,
	|	УстановкаЦенПредметовСнабжения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УстановкаЦенПредметовСнабжения.УсловиеПоставки КАК УсловиеПоставки,
	|	УстановкаЦенПредметовСнабжения.UID КАК UID
	|ИЗ
	|	Документ.УстановкаЦенПредметовСнабжения КАК УстановкаЦенПредметовСнабжения
	|ГДЕ
	|	УстановкаЦенПредметовСнабжения.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЗначенияРеквизитов()
